import { LinkButton } from "@/shared/components";

export const Confidential = () => {
  return (
    <div className="flex justify-center">
      <div className="mt-36 w-[600px] text-sm font-mulish leading-loose">
        <div className="text-center font-bold">
          Политика о конфиденциальности
          <div>Политика в отношении обработки персональных данных</div>
        </div>
        <div className="font-bold mt-6">Общие положения</div>
        <div>
          Настоящая политика обработки персональных данных составлена в
          соответствии указанных требований Закона Республики Казахстан от 21
          мая 2013 года № 94-V «О персональных данных и их защите», а также
          международных договоров, ратифицированных РК. Данная Политика
          конфиденциальности разработана в соответствии с их нормами и
          определяет порядок обработки персональных данных и меры по обеспечению
          безопасности персональных данных, предпринимаемые ТОО «Inventivo»
          (далее – Оператор).
        </div>
        <div className="mt-6">
          Оператор ставит своей важнейшей целью и условием осуществления своей
          деятельности соблюдение прав и свобод человека и гражданина при
          обработке его персональных данных, в том числе защиты прав на
          неприкосновенность частной жизни, личную и семейную тайну.
        </div>
        <div className="mt-6">
          Настоящая политика Оператора в отношении обработки персональных данных
          (далее – Политика) применяется ко всей информации, которую Оператор
          может получить о посетителях веб-сайта
          <LinkButton className=" text-orange-500" to="/">
            https://www.inventivo.io
          </LinkButton>
          ;
        </div>
        <div className="mt-6 font-bold">
          Основные понятия, используемые в Политике
        </div>
        <div className="mt-6">
          Автоматизированная обработка персональных данных – обработка
          персональных данных с помощью средств вычислительной техники;
        </div>
        <div className="mt-6">
          Блокирование персональных данных – временное прекращение обработки
          персональных данных (за исключением случаев, если обработка необходима
          для уточнения персональных данных);
        </div>
        <div className="mt-6">
          Веб-сайт – совокупность графических и информационных материалов, а
          также программ для ЭВМ и баз данных, обеспечивающих их доступность в
          сети интернет по сетевому адресу
          <LinkButton className=" text-orange-500" to="/">
            https://www.inventivo.io;
          </LinkButton>
        </div>
        <div className="mt-6">
          Информационная система персональных данных — совокупность содержащихся
          в базах данных персональных данных, и обеспечивающих их обработку
          информационных технологий и технических средств;
        </div>
        <div className="mt-6">
          Обезличивание персональных данных — действия, в результате которых
          невозможно определить без использования дополнительной информации
          принадлежность персональных данных конкретному Пользователю или иному
          субъекту персональных данных;
        </div>
        <div className="mt-6">
          Обработка персональных данных – любое действие (операция) или
          совокупность действий (операций), совершаемых с использованием средств
          автоматизации или без использования таких средств с персональными
          данными, включая сбор, запись, систематизацию, накопление, хранение,
          уточнение (обновление, изменение), извлечение, использование, передачу
          (распространение, предоставление, доступ), обезличивание,
          блокирование, удаление, уничтожение персональных данных;
        </div>
        <div className="mt-6">
          Оператор – государственный орган, муниципальный орган, юридическое или
          физическое лицо, самостоятельно или совместно с другими лицами
          организующие и (или) осуществляющие обработку персональных данных, а
          также определяющие цели обработки персональных данных, состав
          персональных данных, подлежащих обработке, действия (операции),
          совершаемые с персональными данными;
        </div>
        <div className="mt-6">
          Оператор – государственный орган, муниципальный орган, юридическое или
          физическое лицо, самостоятельно или совместно с другими лицами
          организующие и (или) осуществляющие обработку персональных данных, а
          также определяющие цели обработки персональных данных, состав
          персональных данных, подлежащих обработке, действия (операции),
          совершаемые с персональными данными;
        </div>
        <div className="mt-6">
          Персональные данные – любая информация, относящаяся прямо или косвенно
          к определенному или определяемому Пользователю веб-сайта
          <LinkButton className=" text-orange-500" to="/">
            https://www.inventivo.io;
          </LinkButton>
        </div>
        <div className="mt-6">
          Персональные данные – любая информация, относящаяся прямо или косвенно
          к определенному или определяемому Пользователю веб-сайта
          <LinkButton className=" text-orange-500" to="/">
            https://www.inventivo.io;
          </LinkButton>
        </div>
        <div className="mt-6">
          Предоставление персональных данных – действия, направленные на
          раскрытие персональных данных определенному лицу или определенному
          кругу лиц;
        </div>
        <div className="mt-6">
          Распространение персональных данных – любые действия, направленные на
          раскрытие персональных данных неопределенному кругу лиц (передача
          персональных данных) или на ознакомление с персональными данными
          неограниченного круга лиц, в том числе обнародование персональных
          данных в средствах массовой информации, размещение в
          информационно-телекоммуникационных сетях или предоставление доступа к
          персональным данным каким-либо иным способом;
        </div>
        <div className="mt-6">
          Трансграничная передача персональных данных – передача персональных
          данных на территорию иностранного государства органу власти
          иностранного государства, иностранному физическому или иностранному
          юридическому лицу;
        </div>
        <div className="mt-6">
          Уничтожение персональных данных – любые действия, в результате которых
          персональные данные уничтожаются безвозвратно с невозможностью
          дальнейшего восстановления содержания персональных данных в
          информационной системе персональных данных и (или) уничтожаются
          материальные носители персональных данных.
        </div>
        <div className="mt-6">
          Оператор может обрабатывать следующие персональные данные
          Пользователя:
          <ul className="list-disc ml-4">
            <li>Фамилия, имя, отчество;</li>
            <li>Адрес электронной почты;</li>
            <li>Номера телефонов;</li>
            <li>Год, месяц, дата рождения;</li>
            <li>Пол;</li>
            <li>Сведения о намерении обратиться к врачу;</li>
          </ul>
        </div>
        <div className="mt-6">
          Также на сайте происходит сбор и обработка обезличенных данных о
          посетителях (в т.ч. файлов «cookie») с помощью сервисов
          интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).
        </div>
        <div className="mt-6">
          Вышеперечисленные данные далее по тексту Политики объединены общим
          понятием Персональные данные.
        </div>
        <div className="mt-6 font-bold">Цели обработки персональных данных</div>
        <div className="mt-6">
          Цель обработки персональных данных Пользователя: запись Пользователей
          на прием к врачу через Сайт. Сайт предоставляет общую информацию о
          самодиагностике, доступные тесты для проведения самодиагностики
          пользователей не являются диагнозом перед медицинской манипуляцией и
          не заменяют профессиональную медицинскую помощь / диагностику. Цель
          обработки данных включает предоставление поддержки при использовании
          Сайта, рассылка рекламных и маркетинговых материалов, улучшение работы
          Сайта, получение отзывов и пожеланий по работе Сайта.
        </div>
        <div className="mt-6">
          Оператор имеет право направлять Пользователю уведомления о новых
          продуктах и услугах, специальных предложениях и различных событиях
          посредством электронной рассылки, в том числе с использованием
          мессенджеров, включая WhatsApp.
        </div>
        <div className="mt-6">
          Пользователь всегда может отказаться от получения информационных
          сообщений, направив Оператору письмо на адрес электронной почты
          <a
            className="mx-1 text-orange-500 hover:brightness-125"
            href="mailto:makpal.ikramova@inventivo.io"
          >
            makpal.ikramova@inventivo.io
          </a>
          с пометкой «Отказ от уведомлений о новых продуктах и услугах и
          специальных предложениях».
        </div>
        <div className="mt-6">
          Оператор собирает и обрабатывает персональные данные Пользователей,
          включая касающиеся состояния здоровья. Такие данные предоставляются
          Пользователями непосредственно и только врачам или медицинским
          организациям, которые обязаны соблюдать их конфиденциальность в
          соответствии с применимым законодательством РК.
        </div>
        <div className="mt-6">
          Обезличенные данные Пользователей, собираемые с помощью сервисов
          интернет-статистики, служат для сбора информации о действиях
          Пользователей на сайте, улучшения качества сайта и его содержания.
        </div>
        <div className="mt-6 font-bold">
          Правовые основания обработки персональных данных
        </div>
        <div className="mt-6">
          Оператор обрабатывает персональные данные Пользователя только в случае
          их заполнения и/или отправки Пользователем самостоятельно через
          специальные формы, расположенные на сайте
          <LinkButton className="mr-0 text-orange-500" to="/">
            https://www.inventivo.io
          </LinkButton>
          . Заполняя соответствующие формы и/или отправляя свои персональные
          данные Оператору, Пользователь выражает свое согласие с данной
          Политикой.
        </div>
        <div className="mt-6">
          Оператор обрабатывает обезличенные данные о Пользователе в случае,
          если это разрешено в настройках браузера Пользователя (включено
          сохранение файлов «cookie» и использование технологии JavaScript).
        </div>
        <div className="mt-6">
          Порядок сбора, хранения, передачи и других видов обработки
          персональных данных Безопасность персональных данных, которые
          обрабатываются Оператором, обеспечивается путем реализации правовых,
          организационных и технических мер, необходимых для выполнения в полном
          объеме требований действующего законодательства в области защиты
          персональных данных.
        </div>
        <div className="mt-6">
          Оператор обеспечивает сохранность персональных данных и принимает все
          возможные меры, исключающие доступ к персональным данным
          неуполномоченных лиц. Персональные данные Пользователя никогда, ни при
          каких условиях не будут переданы третьим лицам, за исключением
          случаев, связанных с исполнением действующего законодательства.
        </div>
        <div className="mt-6">
          В случае выявления неточностей в персональных данных, Пользователь
          может актуализировать их самостоятельно, путем направления Оператору
          уведомление на адрес электронной почты Оператора
          makpal.ikramova@inventivo.io с пометкой «Актуализация персональных
          данных».
        </div>
        <div className="mt-6">
          Срок обработки персональных данных является неограниченным.
          Пользователь может в любой момент отозвать свое согласие на обработку
          персональных данных, направив Оператору уведомление посредством
          электронной почты на электронный адрес Оператора
          makpal.ikramova@inventivo.io с пометкой «Отзыв согласия на обработку
          персональных данных».
        </div>
        <div className="mt-6 font-bold">
          Трансграничная передача персональных данных
        </div>
        <div className="mt-6">
          Оператор до начала осуществления трансграничной передачи персональных
          данных обязан убедиться в том, что иностранным государством, на
          территорию которого предполагается осуществлять передачу персональных
          данных, обеспечивается надежная защита прав субъектов персональных
          данных.
        </div>
        <div className="mt-6">
          Трансграничная передача персональных данных на территории иностранных
          государств, не отвечающих вышеуказанным требованиям, может
          осуществляться только в случае наличия согласия в письменной форме
          субъекта персональных данных на трансграничную передачу его
          персональных данных и/или исполнения договора, стороной которого
          является субъект персональных данных.
        </div>
        <div className="mt-6 font-bold">Заключительные положения</div>
        <div className="mt-6">
          Пользователь может получить любые разъяснения по интересующим
          вопросам, касающимся обработки его персональных данных, обратившись к
          Оператору с помощью электронной почты
          <a
            className="ml-1 text-orange-500 hover:brightness-125"
            href="mailto:makpal.ikramova@inventivo.io"
          >
            makpal.ikramova@inventivo.io
          </a>
          .
        </div>
        <div className="mt-6 mb-20">
          В данном документе будут отражены любые изменения политики обработки
          персональных данных Оператором. Политика действует бессрочно до замены
          ее новой версией.
        </div>
      </div>
    </div>
  );
};
