export const Useragreement = () => {
  return (
    <div className="flex justify-center">
      <div className="mt-36 w-[900px] text-sm font-mulish leading-loose">
        <div className="text-center font-bold">Пользовательское соглашение</div>
        <div className="mt-6">
          Настоящее Пользовательское соглашение (далее – Соглашение) заключается
          между ТОО «Inventivo», именуемым в дальнейшем Администрация, и любым
          лицом, намеревающимся использовать и/или использующим интернет-сайт
          inventivo.io (далее – Сайт), именуемым в дальнейшем Пользователь, и
          определяет условия, ограничения и гарантии при использовании Сайта.
        </div>
        <div className="mt-6">
          ИСПОЛЬЗУЯ СЕРВИС, ВЫ СОГЛАШАЕТЕСЬ С НАСТОЯЩИМИ УСЛОВИЯМИ
          ПРЕДОСТАВЛЕНИЯ УСЛУГ. ЕСЛИ ВЫ НЕ ХОТИТЕ БЫТЬ СВЯЗАННЫМИ НАСТОЯЩИМИ
          УСЛОВИЯМИ ПРЕДОСТАВЛЕНИЯ УСЛУГ, ПОЖАЛУЙСТА, ПОКИНЬТЕ СЕРВИС (САЙТ).
          ВАШЕ СРЕДСТВО ПРАВОВОЙ ЗАЩИТЫ В СЛУЧАЕ НЕУДОВЛЕТВОРЕННОСТИ ДАННЫМ
          САЙТОМ ИЛИ ЛЮБЫМИ ПРОДУКТАМИ, УСЛУГАМИ, СОДЕРЖАНИЕМ ИЛИ ДРУГОЙ
          ИНФОРМАЦИЕЙ, ДОСТУПНОЙ НА ДАННОМ САЙТЕ ИЛИ ЧЕРЕЗ НЕГО, ЗАКЛЮЧАЕТСЯ В
          ПРЕКРАЩЕНИИ ИСПОЛЬЗОВАНИЯ САЙТА И/ИЛИ ЭТИХ КОНКРЕТНЫХ УСЛУГ. ВАШЕ
          СОГЛАСИЕ С НАМИ В ОТНОШЕНИИ СОБЛЮДЕНИЯ НАСТОЯЩИХ УСЛОВИЙ ОБСЛУЖИВАНИЯ
          ВСТУПАЕТ В СИЛУ СРАЗУ ПОСЛЕ НАЧАЛА ИСПОЛЬЗОВАНИЯ ВАМИ ДАННОГО СЕРВИСА
          (САЙТА).
        </div>
        <div className="mt-6 font-bold">Общие положения</div>
        <div className="mt-6">
          Настоящее Соглашение является публичной офертой (предложением)
          Администрации, содержащей существенные условия соглашения об
          использовании Сайта Пользователем. Использование Сайта, в том числе
          его просмотр, поиск информации, использование сервисов (далее –
          использование Сайта) возможно только при условии полного и
          безоговорочного принятия условий настоящей оферты (акцепта) в форме,
          установленной настоящим Соглашением.
        </div>
        <div className="mt-6">
          При несогласии с условиями настоящего Соглашения Пользователь обязан
          немедленно прекратить использование Сайта https://inventivo.io
        </div>
        <div className="mt-6">
          Любое использование Сайта Пользователем при отсутствии заключенного
          между Сторонами соглашения является незаконным, Администрация не несет
          ответственности за последствия такого использования Сайта.
        </div>
        <div className="mt-6">
          Акцептом настоящей оферты являются любые действия Пользователя по
          использованию Сайта
        </div>
        <div className="mt-6 font-bold">Предмет соглашения</div>
        <div className="mt-6">
          По настоящему Соглашению Администрация безвозмездно предоставляет
          Пользователю доступ к Сайту, а также к сервисам, размещенным на Сайте,
          а Пользователь обязуется использовать Сайт в соответствии с условиями
          настоящего Соглашения.
        </div>
        <div className="mt-6">
          Пользователь обязуется не использовать Сайт в коммерческих целях без
          предварительного письменного соглашения с Администрацией.
        </div>
        <div className="mt-6">
          Пользователь обязуется не использовать размещенные на Сайте результаты
          интеллектуальной деятельности (в том числе, но не ограничиваясь:
          изображения, тексты, программный код) без предварительного письменного
          согласия Администрации
        </div>
        <div className="mt-6">
          Администрация не оказывает Пользователю медицинских услуг ни
          возмездно, ни безвозмездно, не занимается иной медицинской
          деятельностью, продажей лекарственных средств и иных изделий,
          связанных с медициной, а также не оказывает консультационных услуг.
        </div>
        <div className="mt-6 font-bold">Описание услуг</div>
        <div className="mt-6">
          Сайт является информационно-аналитическим сервисом, предназначенным
          для поиска медицинских учреждений, медицинских услуг, акций, скидок,
          врачей требуемой специализации, квалификации, опыта работы,
          онлайн-записи к ним а также сервис самодиагностики здоровья суставов.
          Сайт предоставляет общую информацию о самодиагностике, доступные тесты
          для проведения самодиагностики пользователей не являются диагнозом
          перед медицинской манипуляцией и не заменяют профессиональную
          медицинскую помощь / диагностику.
        </div>
        <div className="mt-6">
          Информация о врачах, размещаемая на Сайте, может быть получена
          Администрацией непосредственно от медицинских учреждений либо самих
          врачей. Администрация принимает меры по проверке данной информации и
          исключению недостоверных сведений, а также сведений, на размещение
          которых не получено согласия врачей.
        </div>
        <div className="mt-6">
          Администрация гарантирует, что все комментарии, размещаемые на
          страницах Сайта, получены от пациентов, совершивших прием у Заказчика
          посредством онлайн-записи с Сайта. Администрация принимает все
          разумные меры для предотвращения размещения или удаления комментариев
          с заведомо недостоверной либо не соответствующей законодательству
          информацией.
        </div>
        <div className="mt-6">
          Администрация прилагает все разумные усилия, предотвращающие сбои и
          неполадки в работе Сайта, однако не гарантирует его бесперебойную
          работу, не несет ответственности за нее и не обязуется уведомлять
          Пользователей о перебоях.
        </div>
        <div className="mt-6">
          Рейтинг врачей формируется Администрацией на основе установленных
          Администрацией критериев. Администрация гарантирует, что она не берет
          плату за повышение позиций врачей в рейтинге, размещение либо удаление
          комментариев.
        </div>
        <div className="mt-6 font-bold">Конфиденциальная информация</div>
        <div className="mt-6">
          Пользователь дает свое согласие на обработку, в том числе
          автоматизированную, и использование Администрацией персональных данных
          Пользователя, включая сбор, систематизацию, накопление, хранение,
          уточнение (обновление, изменение), использование, распространение (в
          том числе передачу), обезличивание, блокирование и уничтожение.
          Персональные данные Пользователя являются конфиденциальными и не
          подлежат разглашению или предоставлению любым третьим лицам, а также
          несанкционированному использованию.
        </div>
        <div className="mt-6">
          Не считается нарушением предоставление Администрацией информации
          третьим лицам, действующим на основании договора с Администрацией, для
          исполнения обязательств перед Пользователем, а также для улучшения
          сервиса Сайта и для осуществления рассылки. Не считается нарушением
          обязательств разглашение информации в соответствии с обоснованными
          требованиями применимого законодательства. Администрация вправе
          использовать технологию «cookies». Cookies не содержат
          конфиденциальную информацию и не передаются третьим лицам.
          Администрация получает информацию об ip-адресе Посетителя Сайта.
          Данная информация не используется для установления личности
          Пользователя, за исключением случаев мошеннических действий
          Пользователя.
        </div>
        <div className="mt-6">
          При использовании некоторых сервисов Сайта Пользователь сообщает
          Администрации сведения о факте обращения (в том числе намерении
          обратиться) за медицинской помощью к врачу определенной специализации.
          В целях повышения качества оказываемых услуг Администрация вправе
          производить запись телефонных переговоров Пользователя и сотрудников
          Администрации. Пользователь дает разрешение на сбор, хранение и
          обработку данной информации, а также на предоставление ее медицинскому
          учреждению и/или врачу, к которому пользователь обращается за
          оказанием медицинских услуг.
        </div>
        <div className="mt-6">
          Со своей стороны, Администрация обязуется принимать меры по охране
          конфиденциальности данной информации и не разглашать ее третьим лицам,
          кроме указанных в настоящей статье Соглашения.
        </div>
        <div className="mt-6">
          Пользователь дает согласие на использование контактной информации,
          которую он указывает при работе с Сайтом либо которая определяется
          автоматическими средствами фиксации (АОН, средства электронной почты)
          при обращении пользователя к сервисам Сайта, а именно телефона и
          адреса электронной почты, для рассылки SMS-сообщений на телефонный
          номер и электронных писем на email-адрес информационно-рекламного
          характера, содержащих сведения о новостях, акциях и предложениях,
          приводящихся (размещаемых) на Сайте, а также напоминания о предстоящих
          визитах к врачам/ медицинским учреждениям, об изменении статуса записи
          к врачу/медицинскому учреждению.
        </div>
        <div className="mt-6 font-bold">Ограничение ответственности</div>
        <div className="mt-6">
          В связи с тем, что по настоящему Соглашению Пользователю не
          предоставляется никаких возмездных услуг, на отношения между
          Администрацией и Пользователей не распространяется Закон Республики
          Казахстан от 4 мая 2010 года № 274-IV «О защите прав потребителей».
        </div>
        <div className="mt-6">
          Администрация и ее работники ни при каких обстоятельствах не оказывают
          Пользователю медицинских услуг, возмездных или безвозмездных, в том
          числе в форме консультирования, не дают советов о диагностике и
          лечении заболеваний, приеме лекарственных средств и т.п.
        </div>
        <div className="mt-6">
          Информация о медицинских услугах, болезнях, специализации врачей носит
          справочный характер. Администрации не гарантирует ее достоверность и
          соответствие современным научным достижениям. Администрация
          настоятельно рекомендует обращаться за квалифицированной медицинской
          помощью непосредственно к врачам требуемой специализации, в том числе
          к тем, профили которых представлены на Сайте.
        </div>
        <div>
          Информация о врачах, размещаемая на Сайте, насколько известно
          Администрации, является достоверной. Вместе с тем Администрация не
          имеет возможности отслеживать в полной мере наличие необходимой
          документации, подтверждающей право заниматься медицинской
          деятельностью у врачей, хотя и принимает для этого разумные меры. В
          связи с этим Пользователь обязуется при обращении к определенному
          врачу самостоятельно убедиться в наличии у него необходимого
          образования, квалификации, аттестации и лицензии медицинского
          учреждения.
        </div>
        <div className="mt-6">
          Администрация не гарантирует достоверность информации, содержащейся в
          комментариях Пользователей. Администрация удаляет комментарии по
          требованию медицинских учреждений, врачей либо Пользователей только в
          случае предоставления доказательств их явной недостоверности, либо
          противоречия законодательству.
        </div>
        <div className="mt-6">
          Администрация удаляет комментарии по требованиям компетентных
          государственных органов, предъявленным в порядке, установленном
          законом. Администрация вправе в любое время удалить любые комментарии
          и любую иную информацию с Сайта по собственной инициативе.
        </div>
        <div className="mt-6">
          Администрация не обязуется сообщать Пользователям принципы и критерии
          расчета рейтинга врачей, хотя и вправе это сделать, полностью или
          частично.
        </div>
        <div className="mt-6">
          Все сервисы Сайта предоставляются бесплатно и «как есть». Пользователь
          не вправе требовать внесения каких-либо изменений в сервисы либо
          данные Сайта. Администрация не несет ответственности за любой вред, в
          том числе моральный, который может быть причинен Пользователю при
          использовании Сайта, если только отказ от ответственности за такой
          вред не является незаконным по законодательству Республики Казахстан.
        </div>
        <div className="mt-6">
          Администрация ни при каких обстоятельствах не несет ответственности за
          качество медицинских услуг, оказываемых врачами, в том числе профили
          которых размещены на Сайте.
        </div>
        <div className="mt-6">
          Пользователь самостоятельно несет ответственность в случае
          использования им информации и материалов, размещенных на Сайте, в
          лечебных или иных целях. Заключительные положения
        </div>
        <div className="mt-6">
          Настоящее Соглашение действует в течение всего периода использования
          Сайта Пользователем.
        </div>
        <div className="mt-6 mb-20">
          Администрация вправе в любое время изменять условия настоящего
          Соглашения, публикуя новую редакцию на Сайте. Пользователь обязуется
          регулярно просматривать опубликованный на Сайте текст Соглашения с
          целью ознакомления с изменениями.
        </div>
      </div>
    </div>
  );
};
